# Python for Psychologists - Session 3
## Homework assignment

**Exercise 1**. 

Try to create a pd.Dataframe using a dictionary.

Use series 1-3 as columns and set the index to some random safari visitors (i.e. strings)

In [2]:
import pandas as pd

In [3]:
s1 = pd.Series([23,45,75,81,45,11], name="otter")

s2 = pd.Series([51,94,12,23,91,10], name="sloth")

s3 = pd.Series([13,56,44,20,51,60], name="monkey")

In [4]:
animals = {"otter" : s1, "sloth" : s2, "monkey":s3}
animals = pd.DataFrame(animals)

animals = animals.set_index([["a","b","c","d","e","f"]])
animals

   otter  sloth  monkey
a     23     51      13
b     45     94      56
c     75     12      44
d     81     23      20
e     45     91      51
f     11     10      60

**Exercise 2.**

Try to select two rows in our dataframe using ```.iloc``` and explicitly state, that you want to select all columns!

In [5]:
animals.iloc[4:6,:]

   otter  sloth  monkey
e     45     91      51
f     11     10      60

**Exercise 3**.

Add a new column "last_name" @ the first position of your dataframe, using a single line of code! 

Use this list for the new column and think about how to add columns at a specific position.

In [6]:
last_name = ["Mayer", "Baecker", "Ochsmann", "Friedrich", "Stark", "Kraemer"]

In [7]:
animals.insert(0, "last_name", last_name, True)

In [8]:
animals # check your new dataframe

   last_name  otter  sloth  monkey
a      Mayer     23     51      13
b    Baecker     45     94      56
c   Ochsmann     75     12      44
d  Friedrich     81     23      20
e      Stark     45     91      51
f    Kraemer     11     10      60

**Exercise 4**.

Try to rename the first name of your first safari visitor. Instead of using ```.rename``` I ask you to do the following steps:

- get the dataframe`s index and convert it to a list called "index_list" (think about how we converted an int to a str)
- change the first entry of "index_list" using indexing 
- assign your updated index_list to your dataframe`s index
- check your dataframe

In [14]:
index_list = list(animals.index)
index_list[0] = "lala"
animals.index = index_list
animals

      last_name  otter  sloth  monkey
lala      Mayer     23     51      13
b       Baecker     45     94      56
c      Ochsmann     75     12      44
d     Friedrich     81     23      20
e         Stark     45     91      51
f       Kraemer     11     10      60

**Exercise 5**.

Use ```dataframe.loc``` to select all visitors based on the two conditional statements listed below and save it to a new dataframe and check whether it worked correctly:
- last name ends with "er"
- has seen at least 23 otters

You might need to google for the first bullet point, hint: the code you are looking for should somehow check whether a "string" ends with a specific suffix

In [28]:
selection = animals.loc[animals["last_name"].str.endswith("er") & (animals["otter"] >= 23)]

In [29]:
selection

  last_name  otter  sloth  monkey
a     Mayer     23     51      13
b   Baecker     45     94      56